#### Discussão início da aula

O código abaixo terá um erro pelo fato do index das Series serem as columns do DataFrame. Como as columns requisitadas são diferentes do index, todas as células foram preenchindas com NaN.

In [80]:
import numpy as np
import pandas as pd

dias_da_semana = pd.Series(['Seg', 'Ter', 'Qua', 'Qui', 'Sex', 'Sab', 'Dom'])
semana1 = pd.Series([50, 66, 55, 55, 23, np.nan, 92])
semana2 = pd.Series([np.nan, 78, 76, 66, 64, 44, 78])
semana3 = pd.Series([55, 75, 89, 77, 78, 57, np.nan])
semana4 = pd.Series([67, 34, np.nan, 25, 45, np.nan, 95])

df= pd.DataFrame(
    [semana1, semana2, semana3, semana4],
    columns = dias_da_semana,
    index = ['Semana 1','Semana 2','Semana 3','Semana 4']
)
print(df)

          Seg  Ter  Qua  Qui  Sex  Sab  Dom
Semana 1  NaN  NaN  NaN  NaN  NaN  NaN  NaN
Semana 2  NaN  NaN  NaN  NaN  NaN  NaN  NaN
Semana 3  NaN  NaN  NaN  NaN  NaN  NaN  NaN
Semana 4  NaN  NaN  NaN  NaN  NaN  NaN  NaN

In [81]:
dias_da_semana = pd.Series(['Seg', 'Ter', 'Qua', 'Qui', 'Sex', 'Sab', 'Dom'])
semana1 = pd.Series([50, 66, 55, 55, 23, np.nan, 92])
semana2 = pd.Series([np.nan, 78, 76, 66, 64, 44, 78])
semana3 = pd.Series([55, 75, 89, 77, 78, 57, np.nan])
semana4 = pd.Series([67, 34, np.nan, 25, 45, np.nan, 95])

df= pd.DataFrame(
    [semana1, semana2, semana3, semana4],
    index = ['Semana 1','Semana 2','Semana 3','Semana 4']
)
print(df)

             0     1     2     3     4     5     6
Semana 1  50.0  66.0  55.0  55.0  23.0   NaN  92.0
Semana 2   NaN  78.0  76.0  66.0  64.0  44.0  78.0
Semana 3  55.0  75.0  89.0  77.0  78.0  57.0   NaN
Semana 4  67.0  34.0   NaN  25.0  45.0   NaN  95.0

O `rename` é uma possibilidade de correção.

In [82]:
df.rename(columns=dias_da_semana)

           Seg   Ter   Qua   Qui   Sex   Sab   Dom
Semana 1  50.0  66.0  55.0  55.0  23.0   NaN  92.0
Semana 2   NaN  78.0  76.0  66.0  64.0  44.0  78.0
Semana 3  55.0  75.0  89.0  77.0  78.0  57.0   NaN
Semana 4  67.0  34.0   NaN  25.0  45.0   NaN  95.0

`df.columns` é outra opção.

In [83]:
df.columns = dias_da_semana
df

           Seg   Ter   Qua   Qui   Sex   Sab   Dom
Semana 1  50.0  66.0  55.0  55.0  23.0   NaN  92.0
Semana 2   NaN  78.0  76.0  66.0  64.0  44.0  78.0
Semana 3  55.0  75.0  89.0  77.0  78.0  57.0   NaN
Semana 4  67.0  34.0   NaN  25.0  45.0   NaN  95.0

In [84]:
linha1 = pd.Series([10, 20, 30], index = ['a', 'b', 'c'])
linha2 = pd.Series([40, 50, 60], index = ['c', 'd', 'e'])
print(linha1)
print('')
print(linha2)

a    10
b    20
c    30
dtype: int64

c    40
d    50
e    60
dtype: int64

In [85]:
df= pd.DataFrame(
    data = [linha1, linha2],
    columns = ['a', 'c', 'e', 'x']
)
print(df)

      a     c     e   x
0  10.0  30.0   NaN NaN
1   NaN  40.0  60.0 NaN

In [86]:
linha1 = pd.Series(['ABACATE', 'BANANA', 'MACA'], index = ['a', 'b', 'c'])
linha2 = pd.Series(['ABACATE', 'BANANA', 'MACA'], index = ['c', 'd', 'e'])
print(linha1)
print('')
print(linha2)

a    ABACATE
b     BANANA
c       MACA
dtype: object

c    ABACATE
d     BANANA
e       MACA
dtype: object

In [87]:
df= pd.DataFrame(
    data = [linha1, linha2],
    columns = ['a', 'c']
)
print(df)

         a        c
0  ABACATE     MACA
1      NaN  ABACATE

In [88]:
type(df.loc[1,'a'])

float

# Pandas

## Retomando Acesso

Se nosso objetivo for selecionar um único elemento, também podemos usar os métodos `iat` e `at`. O método `iat` recebe como argumento a posição do elemento desejado (posição numérica, independente dos nomes das linhas e das colunas). Já o método `at` recebe os rótulos originais das linhas (índices) e das colunas.

In [89]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'], index = ['Lucas', 'Rafael', 'Juliana', 'Hugo'])
df

         altura  peso
Lucas      1.69  87.0
Rafael     1.59  56.5
Juliana    1.69  90.3
Hugo       1.74  78.6

In [90]:
df.iat[3,1] # = df.iloc[3, 1]

78.6

In [91]:
df.at['Hugo', 'peso'] # = df.loc['Hugo', 'peso']

78.6

In [92]:
df.loc['Rafael']

altura     1.59
peso      56.50
Name: Rafael, dtype: float64

In [93]:
df.at['Rafael']

TypeError: DataFrame._get_value() missing 1 required positional argument: 'col'

> at e iat são pensados para o acesso de um escalar, isto é, um unico elemento no datafrae. Enquanto isso, loc e iloc são pensados para o acesso de múltiplos elementos ao mesmo tempo, potencialmente para a realização de operações vetorizadas.

Podemos também selecionar diferentes subconjuntos do DataFrame.

In [ ]:
dados = [
  [1.69, 87.0, 'Fulano'],
  [1.59, 56.5, 'Sicrana'],
  [1.69, 90.3, 'Beltrana'],
  [1.74, 78.6, 'João']
]
df = pd.DataFrame(dados, columns=['altura', 'peso', 'nomes'], index = [1000, 2000, 3000, 4000])
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df.iloc[1:3]

      altura  peso     nomes
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana

In [ ]:
df.loc[2000: 4000]

      altura  peso     nomes
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df.iloc[:, 1:2]

      peso
1000  87.0
2000  56.5
3000  90.3
4000  78.6

In [ ]:
df.loc[:, "peso":"nomes"]

      peso     nomes
1000  87.0    Fulano
2000  56.5   Sicrana
3000  90.3  Beltrana
4000  78.6      João

In [ ]:
df['altura']

1000    1.69
2000    1.59
3000    1.69
4000    1.74
Name: altura, dtype: float64

In [ ]:
df[['altura', 'peso']]

      altura  peso
1000    1.69  87.0
2000    1.59  56.5
3000    1.69  90.3
4000    1.74  78.6

In [ ]:
df[['peso', 'altura']]

      peso  altura
1000  87.0    1.69
2000  56.5    1.59
3000  90.3    1.69
4000  78.6    1.74

## Consulta de Dados

Podemos usar máscaras booleanas da mesma forma que fizemos com `Series` no pandas e `ndarray` no NumPy.

In [ ]:
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df['peso']>80

1000     True
2000    False
3000     True
4000    False
Name: peso, dtype: bool

In [ ]:
df[df['peso']>80]

      altura  peso     nomes
1000    1.69  87.0    Fulano
3000    1.69  90.3  Beltrana

Porém, objetos do tipo `DataFrame` possuem também outro método para fazer esse tipo de filtro. Esse é o método `query`, que recebe uma string representando o filtro que queremos.

In [ ]:
df.query('peso>80')

      altura  peso     nomes
1000    1.69  87.0    Fulano
3000    1.69  90.3  Beltrana

E as consultas podem crescer indeterminadamente em termos de complexidade

In [ ]:
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df[(df['peso'] > 70) & (df['altura'] > 1.70)]

      altura  peso nomes
4000    1.74  78.6  João

In [ ]:
df.query('peso > 70 and altura > 1.70')

      altura  peso nomes
4000    1.74  78.6  João

In [ ]:
df[df['data_nascimento'].dt.year >= 2020]

KeyError: 'data_nascimento'

## Transformações simples em dataframes Pandas

Sempre que nós buscarmos alterar elementos de um `DataFrame`, devemos acessar os elementos a serem alterados através de um método dentre `at`, `iat`, `loc` e `iloc`.

In [ ]:
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    1.59  56.5   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df.iloc[1,1] = 100
df

      altura   peso     nomes
1000    1.69   87.0    Fulano
2000    1.59  100.0   Sicrana
3000    1.69   90.3  Beltrana
4000    1.74   78.6      João

In [ ]:
df.loc[2000, 'altura'] = 2
df

      altura   peso     nomes
1000    1.69   87.0    Fulano
2000    2.00  100.0   Sicrana
3000    1.69   90.3  Beltrana
4000    1.74   78.6      João

In [ ]:
df.iat[1, 1] = 99
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    2.00  99.0   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

In [ ]:
df.at[2000, 'altura'] = 1.99
df

      altura  peso     nomes
1000    1.69  87.0    Fulano
2000    1.99  99.0   Sicrana
3000    1.69  90.3  Beltrana
4000    1.74  78.6      João

Outra manipulação que fazemos com frequência é a criação de colunas novas. A sintaxe relevante se encontra abaixo.

In [ ]:
df['sobrenomes2'] = ['Almeida', 'Magalhães', 'Silva'] # Se só passarmos uma lista, é necessário ter a mesma quantidade de elementos que o numero de linhas do DataFrame

ValueError: Length of values (3) does not match length of index (4)

In [94]:
df['sobrenomes'] = pd.Series(['Almeida', 'Magalhães', 'Silva'], index = [1000, 2000, 3000])
df

         altura  peso sobrenomes
Lucas      1.69  87.0        NaN
Rafael     1.59  56.5        NaN
Juliana    1.69  90.3        NaN
Hugo       1.74  78.6        NaN

É bem comum, inclusive, criarmos novas colunas como resultado de alguma manipulação sobre colunas previamente existentes

In [95]:
df['altura'] = [1.20, 1.30, 1.40, 1.50]
df

         altura  peso sobrenomes
Lucas       1.2  87.0        NaN
Rafael      1.3  56.5        NaN
Juliana     1.4  90.3        NaN
Hugo        1.5  78.6        NaN

In [96]:
df['altura'] > 1.35

Lucas      False
Rafael     False
Juliana     True
Hugo        True
Name: altura, dtype: bool

In [97]:
df['altura > 30?'] = df['altura'] > 1.35
df

         altura  peso sobrenomes  altura > 30?
Lucas       1.2  87.0        NaN         False
Rafael      1.3  56.5        NaN         False
Juliana     1.4  90.3        NaN          True
Hugo        1.5  78.6        NaN          True

In [98]:
df['altura ** 2'] = df['altura'] ** 2
df

         altura  peso sobrenomes  altura > 30?  altura ** 2
Lucas       1.2  87.0        NaN         False         1.44
Rafael      1.3  56.5        NaN         False         1.69
Juliana     1.4  90.3        NaN          True         1.96
Hugo        1.5  78.6        NaN          True         2.25

E é possível visualizarmos os elementos do pandas como ndarrays do numpy, isto é, acessando exclusivamente os valores de um dataframe, sem incluir índices de linhas ou de colunas.

In [99]:
df.values

array([[1.2, 87.0, nan, False, 1.44],
       [1.3, 56.5, nan, False, 1.6900000000000002],
       [1.4, 90.3, nan, True, 1.9599999999999997],
       [1.5, 78.6, nan, True, 2.25]], dtype=object)

In [100]:
df.to_numpy()

array([[1.2, 87.0, nan, False, 1.44],
       [1.3, 56.5, nan, False, 1.6900000000000002],
       [1.4, 90.3, nan, True, 1.9599999999999997],
       [1.5, 78.6, nan, True, 2.25]], dtype=object)

É possível também fazer operações matemáticas entre dataframes. No caso, o Pandas sempre vai operar entre células de mesmo índice e mesma coluna, e através de métodos específicos do Pandas nós conseguimos configurar um valor padrão a ser incluído na adição para os casos em que o mathing entre índices e colunas não ocorre.

In [101]:
df1 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [2, 4, 6, 8]})
df2 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})
df3 = pd.DataFrame({'a': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})

print(df1)
print('')
print(df2)
print('')
print(df3)

   x  y
0  1  2
1  2  4
2  3  6
3  4  8

   x   y
0  1   3
1  2   6
2  3   9
3  4  12

   a   y
0  1   3
1  2   6
2  3   9
3  4  12

In [102]:
resultado1 = df1+df2
resultado1

   x   y
0  2   5
1  4  10
2  6  15
3  8  20

In [103]:
resultado2 = df1+df3
resultado2

    a   x   y
0 NaN NaN   5
1 NaN NaN  10
2 NaN NaN  15
3 NaN NaN  20

In [104]:
resultado3 = df1.add(df3, fill_value=100)
print(resultado3)

       a      x   y
0  101.0  101.0   5
1  102.0  102.0  10
2  103.0  103.0  15
3  104.0  104.0  20

Além das operações matemáticas, podemos também rearrumar a ordem das linhas da tabela. O método `sort_index` organiza a tabela pelo índice, indo do menor valor para o maior valor, de forma ascendente. Para ordenar de forma descendente, basta colocar `sort_index(ascending=False)`.

In [105]:
data = {'altura': [1.69, 1.50, 1.69, 1.74],
        'peso': [77.2, 64.2, 85.0, 78.6],
        'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes
b    1.69  77.2    Fulano
a    1.50  64.2   Sicrana
c    1.69  85.0  Beltrana
f    1.74  78.6      João

In [106]:
df.sort_index()

   altura  peso     nomes
a    1.50  64.2   Sicrana
b    1.69  77.2    Fulano
c    1.69  85.0  Beltrana
f    1.74  78.6      João

De forma semelhante, podemos ordenar as linhas através dos valores de uma dada coluna, usando o método `sort_values`. É possível organizar indo do menor para o maior, ou o contrário, usando o parâmetro `ascending`.

In [107]:
df.sort_values('peso')

   altura  peso     nomes
a    1.50  64.2   Sicrana
b    1.69  77.2    Fulano
f    1.74  78.6      João
c    1.69  85.0  Beltrana

In [108]:
df.sort_values('peso', ascending=False)

   altura  peso     nomes
c    1.69  85.0  Beltrana
f    1.74  78.6      João
b    1.69  77.2    Fulano
a    1.50  64.2   Sicrana

In [109]:
df.sort_values(['altura', 'nomes'], ascending=[False,True])

   altura  peso     nomes
f    1.74  78.6      João
c    1.69  85.0  Beltrana
b    1.69  77.2    Fulano
a    1.50  64.2   Sicrana

Ainda, podemos manipular os metadados de um dataframe de várias formas.

Podemos remover colunas e alterar nomes de colunas

In [110]:
df.columns

Index(['altura', 'peso', 'nomes'], dtype='object')

In [111]:
df = df.drop(columns=['nomes'])
df

   altura  peso
b    1.69  77.2
a    1.50  64.2
c    1.69  85.0
f    1.74  78.6

In [113]:
df = df[['altura', 'peso']]
df

   altura  peso
b    1.69  77.2
a    1.50  64.2
c    1.69  85.0
f    1.74  78.6

In [114]:
df = df.rename(columns={'altura': 'ALTURA', 'peso': 'PESO'})
df

   ALTURA  PESO
b    1.69  77.2
a    1.50  64.2
c    1.69  85.0
f    1.74  78.6

Como cada coluna é uma Series, podemos nos aproveitar disso para mudar tipos de colunas inteiras usando a função astype

In [116]:
df['PESO'] = df['PESO'].astype(np.int64)
df

   ALTURA  PESO
b    1.69    77
a    1.50    64
c    1.69    85
f    1.74    78

Algo muito fácil de se fazer e tambem muito útil, é utilizar a seleção por colunas para rearranjar o dataframe de alguma forma específica desejada, selecionando e oridenando colunas.

In [117]:
data = {
    'altura': [1.69, 1.50, 1.69, 1.74],
    'peso': [77.2, 64.2, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João'],
    'idade': [30, 25, 35, 40],  # Adicionando a coluna 'idade'
    'sexo': ['M', 'F', 'F', 'M']  # Adicionando a coluna 'sexo'
}

index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes  idade sexo
b    1.69  77.2    Fulano     30    M
a    1.50  64.2   Sicrana     25    F
c    1.69  85.0  Beltrana     35    F
f    1.74  78.6      João     40    M

In [118]:
colunas_desejadas = ['nomes', 'idade', 'altura', 'peso']
df = df[colunas_desejadas]
df

      nomes  idade  altura  peso
b    Fulano     30    1.69  77.2
a   Sicrana     25    1.50  64.2
c  Beltrana     35    1.69  85.0
f      João     40    1.74  78.6

Podemos, também, transformar índices em colunas ou colunas em índices

In [119]:
df.reset_index(inplace=True)

In [120]:
df

  index     nomes  idade  altura  peso
0     b    Fulano     30    1.69  77.2
1     a   Sicrana     25    1.50  64.2
2     c  Beltrana     35    1.69  85.0
3     f      João     40    1.74  78.6

In [121]:
df.set_index('nomes')

         index  idade  altura  peso
nomes
Fulano       b     30    1.69  77.2
Sicrana      a     25    1.50  64.2
Beltrana     c     35    1.69  85.0
João         f     40    1.74  78.6

In [123]:
df.columns = ['a', 'b', 'c', 'd', 'e']

In [124]:
df

   a         b   c     d     e
0  b    Fulano  30  1.69  77.2
1  a   Sicrana  25  1.50  64.2
2  c  Beltrana  35  1.69  85.0
3  f      João  40  1.74  78.6

## Transformações em DataFrames com a função `.apply()`

Um recurso muito útil e muito utilizado, seja para a transformação de dataframes quanto para a criação de colunas derivadas em dataframes, é a função apply. Podemos fazer o uso da função apply a partir de uma associação com o que chamamomos de função lambda. E isto pode incluir ou não uma função definida em outro momento do nosso código.

In [125]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}

df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [126]:
# Eu poderia fazer assim:
# df['altura_ao_quadrado'] = df['altura']**2
# df['imc'] = df['peso'] / df['altura_ao_quadrado']
# df

In [127]:
# mas vou fazer assim
df['imc'] = df.apply(lambda row: row['peso'] / (row['altura'] ** 2), axis=1)
df

   altura  peso        imc
0    1.69  77.2  27.029866
1    1.50  68.0  30.222222
2    1.58  65.0  26.037494
3    1.69  85.0  29.760863
4    1.74  78.6  25.961157
5    1.73  69.2  23.121387

In [129]:
# Definir a função para calcular o IMC
def calcular_imc(row):
    return row['peso'] / (row['altura'] ** 2)

# Aplicar a função usando apply
df['imc'] = df.apply(calcular_imc, axis=1)
df

   altura  peso        imc
0    1.69  77.2  27.029866
1    1.50  68.0  30.222222
2    1.58  65.0  26.037494
3    1.69  85.0  29.760863
4    1.74  78.6  25.961157
5    1.73  69.2  23.121387

> O parâmetro axis na função apply() do Pandas é usado para especificar a direção ao longo da qual a função será aplicada. Quando axis=1, a função será aplicada ao longo das colunas (ou seja, para cada linha), enquanto quando axis=0, a função será aplicada ao longo das linhas (ou seja, para cada coluna).

## Tratamento e limpeza de dados

É muito comum em um conjunto de dados, seja ele proveniente de um banco dados ou de um arquivo csv, existirem valores nulos (ou seja, valores inválidos ou vazios).

Para fins de análises/modelos é muito importante identificar a incidência desses valores e tomar uma decisão, seja a de remover os valores nulos, ou a de substituí-los. Veremos abaixo como fazer ambos.

Identificando Elementos Nulos por Coluna: Identificar a quantidade de valores nulos por coluna é muito importante, pois assim podemos identificar qual ação é mais adequada.

In [138]:
data = {
    'altura': ['a', 'b', 'c', None],
    'peso': [77.2, np.nan, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']
}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b   NaN   Sicrana
c      c  85.0  Beltrana
f   None  78.6      João

In [139]:
df.isnull()

   altura   peso  nomes
b   False  False  False
a   False   True  False
c   False  False  False
f    True  False  False

In [140]:
df.isnull().sum()

altura    1
peso      1
nomes     0
dtype: int64

Removendo os valores nulos: Para remover os nulos, iremos utilizar o comando dropna, como segue:

In [141]:
df.dropna()

  altura  peso     nomes
b      a  77.2    Fulano
c      c  85.0  Beltrana

Ou seja, ele removeu todas as linhas que contém algum valor nulo.

Substituindo valores nulos: Como muitas vezes não queremos diminuir o tamanho do nosso conjunto de dados, então uma abordagem é substituir esses valores (seja pela média dos valores, pela moda etc.).

Para fazer isso, podemos utilizar o método fillna, em que o parâmetro passado será o valor de substituição. Neste exemplo iremos substituir os valores por -1, mas poderia ser qualquer outro valor.

In [142]:
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b   NaN   Sicrana
c      c  85.0  Beltrana
f   None  78.6      João

In [143]:
df = df.fillna(-1)
df

  altura  peso     nomes
b      a  77.2    Fulano
a      b  -1.0   Sicrana
c      c  85.0  Beltrana
f     -1  78.6      João

Se quisermos alterar um valor específico na nossa tabela (não apenas o NaN), podemos usar o método replace.

In [144]:
df.replace(-1, 60)

  altura  peso     nomes
b      a  77.2    Fulano
a      b  60.0   Sicrana
c      c  85.0  Beltrana
f     60  78.6      João

Veja que alteramos os valores de todo o dataframe e não só de uma coluna.

Outro tratamento importante é remover duplicatas da nossa tabela.

In [145]:
data = {
    'a': [1, 1, 2, 2],
    'b': [0, 0, 1, 2]
}

df_dup = pd.DataFrame(data)
df_dup

   a  b
0  1  0
1  1  0
2  2  1
3  2  2

In [153]:
df_dup.drop_duplicates(keep='first')

   a  b
0  1  0
2  2  1
3  2  2

## Exploração de dados

Podemos aproveitar o Pandas para ajudar na exploração dos dados. Existem diversos métodos para nos ajudar a sumarizar dados e calcular algumas estatísticas descritivas.

Como um exemplo, podemos ver a média de cada coluna de um dataframe.

In [147]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}
df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [154]:
df.mean()

altura     1.655000
peso      73.833333
dtype: float64

Também podemos achar outras informações, como o maior e o menor valor das colunas.

In [155]:
df.min()

altura     1.5
peso      65.0
dtype: float64

In [156]:
df.max()

altura     1.74
peso      85.00
dtype: float64

Um método muito útil, que reune várias descrições ao mesmo tempo é o describe.

In [157]:
df.describe()

         altura       peso
count  6.000000   6.000000
mean   1.655000  73.833333
std    0.094816   7.645565
min    1.500000  65.000000
25%    1.607500  68.300000
50%    1.690000  73.200000
75%    1.720000  78.250000
max    1.740000  85.000000

Quando estamos fazendo análises em um conjunto de dados, é muito útil saber alguns comportamentos separados por grupos. <br>Para isso, usamos a função groupby assoaciada a alguma função de agregação.

In [158]:
data = {
    'categoria': ['eletrônicos', 'eletrônicos', 'vestuário', 'vestuário', 'acessórios'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}
df_vendas = pd.DataFrame(data)
df_vendas

     categoria  valor_venda
0  eletrônicos         1000
1  eletrônicos         1500
2    vestuário          800
3    vestuário         1200
4   acessórios          500

In [159]:
df_vendas.groupby('categoria')

In [178]:
df_vendas.groupby('categoria').sum()

                mes  valor_venda
categoria
acessórios      jan          500
eletrônicos  janjan         2500
vestuário    fevfev         2000

In [179]:
df_vendas.groupby('categoria').count()['mes'].sort_values(ascending=False)

categoria
eletrônicos    2
vestuário      2
acessórios     1
Name: mes, dtype: int64

In [161]:
df_vendas.groupby('categoria').mean()

             valor_venda
categoria
acessórios         500.0
eletrônicos       1250.0
vestuário         1000.0

Podemos realizar agrupamentos também em múltiplas colunas.

In [162]:
data = {
    'categoria': ['eletrônicos', 'eletrônicos', 'vestuário', 'vestuário', 'acessórios'],
    'mes': ['jan', 'jan', 'fev', 'fev', 'jan'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}

df_vendas = pd.DataFrame(data)
df_vendas

     categoria  mes  valor_venda
0  eletrônicos  jan         1000
1  eletrônicos  jan         1500
2    vestuário  fev          800
3    vestuário  fev         1200
4   acessórios  jan          500

In [163]:
df_vendas.groupby(['categoria', 'mes']).sum()

                 valor_venda
categoria   mes
acessórios  jan          500
eletrônicos jan         2500
vestuário   fev         2000

In [164]:
df_vendas.groupby(['categoria', 'mes']).median()

                 valor_venda
categoria   mes
acessórios  jan        500.0
eletrônicos jan       1250.0
vestuário   fev       1000.0

In [165]:
df_vendas.groupby(['categoria', 'mes']).max()

                 valor_venda
categoria   mes
acessórios  jan          500
eletrônicos jan         1500
vestuário   fev         1200

In [166]:
df_vendas

     categoria  mes  valor_venda
0  eletrônicos  jan         1000
1  eletrônicos  jan         1500
2    vestuário  fev          800
3    vestuário  fev         1200
4   acessórios  jan          500